import Link from 'next/link';

import { HeroSection } from '@/components';
import styles from '@/styles/pages/TermsPage.module.scss';

export default function Page() {
  return (
    <main className={styles.wrapper}>
      <HeroSection>
        <div className={styles.container}>
          <h1>Умови участі</h1>
        </div>
      </HeroSection>

      <section className={styles.terms}>
        <div>
          <h2 className={styles.heading2}>
            Ані руш! Шпигуєте за дивами? Тоді ви у правильному місці!
          </h2>
          <p className={styles.text}>
            Маєте право зберігати мовчання, поки уважно читаєте: ми — громадська
            організація «Навчай для України», і ми працюємо над тим, щоб
            українська освіта була доступною всім, незалежно від місця
            народження або проживання.
          </p>
          <p className={styles.text}>
            Ми віримо в особливе диво — силу маленьких, проте щоденних освітніх
            кроків. Запрошуємо українських школярів пережити історію про диво у
            різдвяному адвент-календарі. З нас — завдання, з вас — виконання. З
            нас — подарунки, з вас — віра у свої сили й прагнення зростати.
          </p>
        </div>

        <div>
          <h3 className={styles.heading3}>Реєстрація</h3>
          <p className={styles.text}>
            Дитина самостійно чи з допомогою батьків заповнює форму реєстрації.
            Зауважимо: у формі потрібно отримати згоду батьків на участь дитини
            в адвент-календарі.
          </p>
        </div>

        <div>
          <h3 className={styles.heading3}>Старт пригоди – 1 грудня</h3>
          <p className={styles.text}>
            Дочекайтеся 1 грудня і занурюйтесь в історію, в якій станете
            головними героями секретної різдвяної місії. На сторінці календаря
            щодня активуватимуться віконечка із завданнями, а отже кожен день
            зможе наблизити вас до успіху в пригоді.{' '}
            <span className={styles.accent}>
              Виконуйте завдання протягом 25 днів.
            </span>
          </p>
          <p className={styles.text}>
            Забирайте свою{' '}
            <span className={styles.accent}>справедливу винагороду</span> за
            участь у секретній різдвяній місії! 26 грудня серед учасників та
            учасниць, які своєчасно пройшли усі завдання, ми розіграємо
            подарунки до свят – мініпринтери, термочашки, павербанки,
            подарункові сертифікати та мерч ГО «Навчай для України».
          </p>
        </div>

        <q className={styles.quote}>
          &quot;Як освітні посередники та вірні штурмани дітей у навчальних
          пригодах, ми переконані, що якісна освіта та зацікавленість дітей у
          навчанні не повинні бути дивом! Проте саме диво історії може нагади
          дітям про природну спраглість до відкриттів. Давайте разом напишемо
          історію освітнього дива у різдвяному адвент-календарі ❤️&quot;
        </q>

        <Link
          className={styles.link}
          href="./files/official-rules-of-participation.pdf"
          target="_blank"
          rel="noopener noreferrer nofollow">
          Офіційні умови участі
        </Link>
      </section>
    </main>
  );
}
