export const congratulationWord = [
  'Вітаємо героїв нашої пригоди!',
  'Ми щиро вдячні, що ви доєдналися до цієї святкової пригоди! Завдяки вашим зусиллям телепорт ожив, знання примножились, а навички прокачалися до рівня майстрів. Але на цьому сюрпризи не закінчуються!',
  'Якщо ви старанно виконували завдання календаря й завершили всі випробування вчасно, то ми запрошуємо вас до участі в розіграші подарунків, який відбудеться в січні. Це ваш шанс отримати не лише знання, але й маленький подаруночок! Що на вас чекає?',
  '- термопринтери;',
  '- термочашки;',
  '- павербанки;',
  '- подарункові сертифікати;',
  '- фірмовий мерч ГО «Навчай для України».',
  'Дякуємо, що були з нами! Ви довели, що спільні пригоди дарують справжні дива!',
];
