export const introductoryWord = [
  '«Бульк-бульк, пшшшш, пук-пук-пук» — щоразу закипає кров всередині нас від почуття всеохопної несправедливості.',
  'Ті, хто наділені владою загнати нас до ліжка на нічний сон; ті, хто мають безлімітну владу над своїм життям і могли б присвятити його картоплі-фрі, піці та ТікТоку — наші любі дорослі — тягнуть нас у безодню скучного, ультрануднякового життя.',
  'Якими нетямущими в дивах бувають ті затуркані, натомлені дорослі! Вони щодня обирають ті ж самі до жаху примітивні сценарії: битва з брудним посудом, сесія скавчання над новинами, великий похід на роботу, який супроводжується літрами чудодійного еліксиру, буквально джерела життя і початку всього — кави.',
  'Здається, якщо дорослі не питимуть стільки кави, то вмить перетворяться на дітей. А вони цього, очевидно, зовсім не хочуть. Бо бути дитиною — важко!',
  'На наших плечах — баланс див у Всесвіті. Дорослим цієї відповідальності не зрозуміти!',
  'Відважна місія, особливо напередодні Різдва, коли на терезах — новий телефон або різка від Святого Миколая за найяскравіші пригоди протягом року. Ну чому нам потрібно обирати?',
  'От би було добре, якби була змога побудувати телепорт у дитинство для цих нетямущих у розвагах дорослих. Оце була б конкретна, конкретюща пригода! Із гарантією безлімітного доступу до ТікТоку, картоплі-фрі й піци.',
  'І що ж нас так сильно приваблює стати одними із тих нудних дорослих? Адже саме цим людям ми іноді хочемо нагадати про дитячі права, коли вони торочать про обовʼязки, наче в нас тут кріпаччина. Що ж, окрім винайдення телепорту, нам належить також зʼясувати, чому виникають ці розбіжності. І знову така відповідальність, дорослим навіть не уявити!',
  'Упродовж наступних 25 днів ми накопичуватимемо суперзнання та спеціальні артефакти, щоб збудувати такий телепорт. Дорослі навіть не уявляють, на які ризики ми йдемо, коли вирушаємо в таку пригоду. Але заради них ми готові на все.',
  'Не поминайте лихом… Початок секретної місії «Телепорт для нетямущих у дивах» через 3, 2, 1… Пане Штурмане, дайте команду!',
];
