import Link from 'next/link';

import { HeroSection } from '@/components';
import styles from '@/styles/pages/PrivacyPolicyPage.module.scss';

export default function Page() {
  return (
    <main className={styles.wrapper}>
      <HeroSection>
        <div className={styles.container}>
          <h1>Політика конфіденційності</h1>
        </div>
      </HeroSection>

      <section className={styles.terms}>
        <div>
          <h2>
            Повідомлення про обробку персональних даних онлайн-гри «Різдвяний
            адвент-календар» від ГО «Навчай для України» (далі – Повідомлення)
          </h2>
          <p className={styles.text}>
            Усі визначення, вжиті з великої літери, вживаються у такому ж
            значені, яке надане їм в Офіційних Правилах участі в онлайн-грі
            «Різдвяний адвент-календар» від ГО «Навчай для України», що
            розміщені за посиланням{' '}
            <Link
              className={styles.link}
              href="https://advent.teachforukraine.org/"
              target="_blank"
              rel="noopener noreferrer nofollow">
              https://advent.teachforukraine.org/
            </Link>
            .
          </p>
          <p className={styles.text}>
            Інші визначення вживаються у значенні, які надані їм Законом України
            “Про захист персональних даних”.
          </p>
          <p className={styles.text}>
            Беручи участь у Грі, Учасники, їх батьки або особи, що їх замінюють
            підтверджують, що вони ознайомлені з цим Повідомленням, а також з їх
            правами, передбаченими ст. 8 Закону України «Про захист персональних
            даних»
          </p>
          <ol>
            <li>
              Склад та мета обробки персональних даних
              <ol>
                <li>
                  Організатор обробляє наступний обсяг персональних даних
                  Учасника Гри:
                  <ul>
                    <li>прізвище, ім’я та по батькові Учасника;</li>
                    <li>стать;</li>
                    <li>область проживання Учасника Гри;</li>
                    <li>клас, в якому навчається Учасник Гри;</li>
                    <li>номер телефону;</li>
                    <li>адреса електронної пошти.</li>
                  </ul>
                </li>
                <li>
                  У випадку, якщо Учасника буде обрано Претендентом на отримання
                  Заохочення, Організатор додатково обробляє наступні
                  персональні дані:
                  <ul>
                    <li>
                      прізвище, ім’я та по батькові батьків Учасника чи осіб, що
                      їх замінюють;
                    </li>
                    <li>номер телефону;</li>
                    <li>адресу доставки Заохочення.</li>
                  </ul>
                </li>
                <li>
                  Персональні дані збираються з метою:
                  <ul>
                    <li>проведення Гри;</li>
                    <li>визначення Претендентів та Переможців Гри;</li>
                    <li>надання Переможцям Гри Заохочення.</li>
                  </ul>
                </li>
              </ol>
            </li>

            <li>
              Відомості про Володільця персональних даних
              <ol>
                <li>
                  Володільцем персональних даних, що обробляються з метою
                  проведення Гри є Громадська організація «Навчай для України»
                  (Код ЄДРПОУ 40817386), що є Організатором Гри.
                </li>
              </ol>
            </li>

            <li>
              Збір та накопичення персональних даних
              <ol>
                <li>
                  Персональні дані Учасника Гри збираються Організатором Гри під
                  час проходження Учасником реєстрації у Грі.
                </li>
                <li>
                  Персональні дані батьків Учасника чи осіб, що їх замінюють,
                  збираються Організатором Гри виключно у випадку, якщо Учасник
                  Гри визначений Претендентом на отримання Заохочення та не
                  досяг повноліття.
                </li>
              </ol>
            </li>

            <li>
              Взаємодія з третіми особами
              <ol>
                <li>
                  Організатор зобов’язується не передавати персональних даних
                  третім сторонам без згоди відповідних суб’єктів персональних
                  даних, за винятком випадків, передбачених законодавством та
                  умовами надсилання Заохочень Переможцям.
                </li>
                <li>
                  Організатор залишає за собою право на передачу персональних
                  даних третім особам у випадках, коли така передача є
                  необхідною для виконання Організатором обов’язків,
                  передбачених Правилами. Водночас Організатор зобов’язується
                  належним чином перевірити дотримання стандартів захисту
                  персональних даних такими третіми особами.
                </li>
                <li>
                  У випадку виникнення будь-яких питань щодо захисту
                  персональних даних, суб’єкт персональних даних може зв’язатись
                  з Організатором за адресою електронної пошти:{' '}
                  <Link
                    className={styles.link}
                    href="mailto:osvitniisup.info@gmail.com"
                    target="_blank">
                    osvitniisup.info@gmail.com
                  </Link>
                  .
                </li>
              </ol>
            </li>

            <li>
              Політика щодо дітей
              <ol>
                <li>
                  Організатор не збирає і не обробляє персональні дані дітей
                  віком до 18 років без згоди батьків або опікунів. Реєстрація
                  Учасника автоматично означає ознайомлення та згоду з цим
                  Повідомленням батьків на участь дитини у Грі.
                </li>
              </ol>
            </li>

            <li>
              Права Учасників Гри щодо персональних даних
              <ol>
                <li>
                  Учасники Гри, як суб’єкти персональних даних, наділені правами
                  передбаченими ст. 8 Закону України «Про захист персональних
                  даних», а саме:
                  <ol>
                    <li>
                      знати про джерела збирання, місцезнаходження своїх даних,
                      мету їх обробки, володільця чи розпорядника, а також умови
                      надання доступу до даних;
                    </li>
                    <li>отримувати доступ до власних персональних даних;</li>
                    <li>
                      пред’являти вмотивовану вимогу щодо зміни або власних
                      персональних даних;
                    </li>
                    <li>
                      вмотивовано заперечувати проти обробки власних
                      персональних даних;
                    </li>
                    <li>
                      відкликати згоду на обробку власних персональних даних,
                      якщо дані обробляються на підставі згоди;
                    </li>
                    <li>
                      знати механізм автоматичної обробки персональних даних;
                    </li>
                    <li>
                      на захист від автоматизованого рішення, яке має для
                      Учасника Гри правові наслідки;
                    </li>
                    <li>
                      звертатися зі скаргами до Уповноваженого ВРУ з прав людини
                      або до суду.
                    </li>
                  </ol>
                </li>
              </ol>
            </li>

            <li>
              Зміни до політики конфіденційності
              <ol>
                <li>
                  Організатор залишає за собою право оновлювати або змінювати це
                  Повідомлення в будь-який час. Про будь-які зміни Організатор
                  буде інформувати суб’єктів персональних даних через оновлення
                  цієї сторінки. Організатор рекомендує періодично переглядати
                  це Повідомлення для отримання актуальної інформації про
                  порядок обробки персональних даних.
                </li>
              </ol>
            </li>
          </ol>
        </div>
      </section>
    </main>
  );
}
