import Link from 'next/link';

import { HeroSection } from '@/components';
import styles from '@/styles/pages/PrivacyPolicyPage.module.scss';

export default function Page() {
  return (
    <main className={styles.wrapper}>
      <HeroSection>
        <div className={styles.container}>
          <h1>Політика конфіденційності</h1>
        </div>
      </HeroSection>

      <section className={styles.terms}>
        <div>
          <h2>«Різдвяний адвент-календар» від ГО «Навчай для України»</h2>
          <p className={styles.text}>
            Політика конфіденційності онлайн-гри «Різдвяний адвент-календар» має
            на меті захист особистої інформації користувачів. Нижче наведені
            ключові пункти, які регулюють збір, обробку, використання та захист
            персональних даних.
          </p>
          <p className={styles.text}>
            Беручи участь у Грі, що батьки або особи, що їх замінюють Учасника
            Гри підтверджують, що є ознайомленими з правами їх, як суб`єкта
            персональних даних, передбаченими ст. 8 Закону України «Про захист
            персональних даних»
          </p>
          <p className={styles.text}>
            Згідно якої суб&apos;єкт персональних даних має право:
          </p>
          <ol className={styles.parenthesisedList}>
            <li>
              знати про джерела збирання, місцезнаходження своїх персональних
              даних, мету їх обробки, місцезнаходження або місце проживання
              (перебування) володільця чи розпорядника персональних даних або
              дати відповідне доручення щодо отримання цієї інформації
              уповноваженим ним особам, крім випадків, встановлених законом;
            </li>
            <li>
              отримувати інформацію про умови надання доступу до персональних
              даних, зокрема інформацію про третіх осіб, яким передаються його
              персональні дані;
            </li>
            <li>на доступ до своїх персональних даних;</li>
            <li>
              отримувати не пізніш як за тридцять календарних днів з дня
              надходження запиту, крім випадків, передбачених законом, відповідь
              про те, чи обробляються його персональні дані, а також отримувати
              зміст таких персональних даних;
            </li>
            <li>
              пред’являти вмотивовану вимогу володільцю персональних даних із
              запереченням проти обробки своїх персональних даних;
            </li>
            <li>
              пред&apos;являти вмотивовану вимогу щодо зміни або знищення своїх
              персональних даних будь-яким володільцем та розпорядником
              персональних даних, якщо ці дані обробляються незаконно чи є
              недостовірними;
            </li>
            <li>
              на захист своїх персональних даних від незаконної обробки та
              випадкової втрати, знищення, пошкодження у зв&apos;язку з умисним
              приховуванням, ненаданням чи несвоєчасним їх наданням, а також на
              захист від надання відомостей, що є недостовірними чи ганьблять
              честь, гідність та ділову репутацію фізичної особи;
            </li>
            <li>
              звертатися із скаргами на обробку своїх персональних даних до
              Уповноваженого або до суду;
            </li>
            <li>
              застосовувати засоби правового захисту в разі порушення
              законодавства про захист персональних даних;
            </li>
            <li>
              вносити застереження стосовно обмеження права на обробку своїх
              персональних даних під час надання згоди;
            </li>
            <li>відкликати згоду на обробку персональних даних;</li>
            <li>знати механізм автоматичної обробки персональних даних;</li>
            <li>
              на захист від автоматизованого рішення, яке має для нього правові
              наслідки.
            </li>
          </ol>
        </div>

        <div>
          <h3>Принципи конфіденційності</h3>
          <p className={styles.text}>
            Ми зобов’язуємось дотримуватись основних принципів конфіденційності,
            включаючи прозорість, законність, цілісність даних та обмеження їх
            обробки.
          </p>
          <ol>
            <li>
              <b>Законність, справедливість і прозорість:</b> Ми обробляємо
              персональні дані законно, справедливо і прозоро стосовно суб’єкта
              даних.
            </li>
            <li>
              <b>Обмеження мети:</b> Ми збираємо персональні дані для
              визначених, явних і законних цілей і не обробляємо їх надалі у
              спосіб, несумісний із цими цілями.
            </li>
            <li>
              <b>Мінімізація даних:</b> Ми збираємо лише ті персональні дані,
              які є адекватними, доречними і обмеженими до необхідного для
              цілей, для яких вони обробляються.
            </li>
            <li>
              <b>Зберігання даних:</b> Ми зберігаємо персональні дані у формі,
              яка дозволяє ідентифікацію суб’єктів даних не довше, ніж це
              необхідно для цілей, для яких ці дані обробляються.
            </li>
          </ol>
        </div>

        <div>
          <h3>Збір та зберігання інформації:</h3>
          <p className={styles.text}>
            Наша політика спрямована на забезпечення конфіденційності та безпеки
            особистої інформації. Ми здійснюємо збір лише тієї інформації,яка
            необхідна для досягнення покладених цілей у Грі та можливості
            реалізації правил проведення Гри.
          </p>
        </div>

        <div>
          <h3>Використання інформації:</h3>
          <p className={styles.text}>
            Ми хочемо повідомити наших користувачів, що ми строго дотримуємося
            принципу невикористання зібраної інформації для будь-яких цілей,
            крім тих, які прямо пов’язані з грою. Ми не збираємо та не
            використовуємо особисті дані наших користувачів в комерційних цілях,
            не передаємо їх третім сторонам для рекламних або аналітичних цілей
            та не використовуємо їх без згоди користувачів. Наша мета полягає у
            створенні захищеного та конфіденційного середовища для гри, де
            користувачі можуть насолоджуватися досвідом без будь-яких страхів
            щодо можливого неправомірного використання їхніх особистих даних. Ми
            вдячні за довіру, яку ви нам надаєте, і зобов’язуємося дотримуватися
            високих стандартів захисту приватності в усіх аспектах роботи з
            вашою інформацією.
          </p>
        </div>

        <div>
          <h3>Захист інформації:</h3>
          <p className={styles.text}>
            Ми обмежуємо доступ до особистої інформації лише тим співробітникам,
            які потребують її для виконання своїх обов’язків.
          </p>
        </div>

        <div>
          <h3>Передача інформації третім сторонам:</h3>
          <p className={styles.text}>
            Ми зобов’язуємось не передавати жодної інформації про наших
            користувачів третім сторонам без їхньої згоди, за винятком випадків,
            передбачених законодавством та умовами для надсилання Заохочень для
            Переможців. Ми вважаємо особисту інформацію користувачів
            конфіденційною і усвідомлюємо важливість забезпечення її повної
            безпеки.
          </p>
          <p className={styles.text}>
            У випадках, коли передача інформації третім сторонам є необхідною
            для надання наших послуг (наприклад, постачальникам технічної
            підтримки), ми забезпечуємо, що ці треті сторони зобов’язуються
            дотримуватися високих стандартів захисту персональних даних та
            конфіденційності.
          </p>
          <p className={styles.text}>
            Якщо у вас є будь-які питання або занепокоєння щодо захисту вашої
            інформації, будь ласка, зв’яжіться з нами за адресою{' '}
            <Link
              className={styles.link}
              href="mailto:osvitniisup.info@gmail.com"
              target="_blank"
              rel="noopener noreferrer nofollow">
              osvitniisup.info@gmail.com
            </Link>
            .
          </p>
        </div>

        <div>
          <h3>Політика щодо дітей</h3>
          <p className={styles.text}>
            Ми не збираємо і не обробляємо персональні дані дітей віком до 18
            років без згоди батьків або опікунів. Ознайомлення та згода з цією
            політикою конфіденційності автоматично означає згоду батьків на
            участь дитини в онлайн-грі.
          </p>
        </div>

        <div>
          <h3>Контроль над персональними даними</h3>
          <p className={styles.text}>
            Учасники можуть звертатися до нас для реалізації своїх прав на
            доступ, виправлення, видалення, обмеження обробки, а також на
            перенесення даних.
          </p>
        </div>

        <div>
          <h3>Зв’язок із нами:</h3>
          <p className={styles.text}>
            Адреса:Адреса місцезнаходження Організатора: вул. Воздвиженська,
            Буд. 45-49, оф. 505, м. Київ, Україна, 04071
          </p>
          <p className={styles.text}>
            Email:{' '}
            <Link
              className={styles.link}
              href="mailto:osvitniisup.info@gmail.com"
              target="_blank"
              rel="noopener noreferrer nofollow">
              osvitniisup.info@gmail.com
            </Link>
          </p>
        </div>

        <div>
          <h3>Зміни до політики конфіденційності</h3>
          <p className={styles.text}>
            Ми залишаємо за собою право оновлювати або змінювати цю політику
            конфіденційності в будь-який час. Про будь-які зміни ми будемо
            інформувати користувачів через оновлення цієї сторінки. Ми
            рекомендуємо періодично переглядати цю політику для отримання
            найактуальнішої інформації про наші практики конфіденційності.
          </p>
        </div>
      </section>
    </main>
  );
}
