import Image from 'next/image';

import styles from '@/styles/components/cards/TaskNarrativeCard.module.scss';

const TaskNarrativeCard = ({ imgSrc, text }) => {
  return (
    <div className={styles.card}>
      <Image
        className={styles.narrativeImg}
        src={imgSrc}
        width={290}
        height={295}
        alt="Картка"
      />

      <div className={styles.container}>
        <p className={styles.text}>
          От халепа! Ми тільки-но налаштувалися на нові пригоди, аж раптом —
          бац! — світло зникло, як морозиво в літню спеку! Ну точно, це дорослі
          щось накрутили, щоб завадити нашій суперважливій місії.
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
        <p className={styles.text}>
          Світло зникло — темно, як у носі в бегемота. Аж хочеться лампочку
          прикрутити до голови, щоб хоч щось розгледіти! Без електрики все
          зупинилося: ні тобі зарядки для телефону, ні котиків у ТікТоці! Ну що
          ж, тепер наше завдання — знайти цей секретний шифр-ключ і повернути
          ясність, блиск і... ТікТок, звісно!
        </p>
      </div>
    </div>
  );
};

export default TaskNarrativeCard;
